package org.Oracle;

public class Text {

    public String[] getAllCards() {

        return new String[]{"0. ШУТ", "I. МАГ", "II. ЖРИЦА", "III. ИМПЕРАТРИЦА", "IV. ИМПЕРАТОР", "V. ИЕРОФАНТ",
                "VI. ВЛЮБЛЕННЫЕ", "VII. КОЛЕСНИЦА", "VIII. СИЛА", "IX. ОТШЕЛЬНИК", "X. КОЛЕСО ФОРТУНЫ",
                "XI. ПРАВОСУДИЕ", "XII. ПОВЕШЕННЫЙ", "XIII. СМЕРТЬ", "XIV. УМЕРЕННОСТЬ", "XV. ДЬЯВОЛ", "XVI. БАШНЯ",
                "XVII. ЗВЕЗДА", "XVIII. ЛУНА", "XIX. СОЛНЦЕ", "XX. СУД", "XXI. МИР", "Туз Пентаклей", "2 Пентаклей",
                "3 Пентаклей", "4 Пентаклей", "5 Пентаклей", "6 Пентаклей", "7 Пентаклей", "8 Пентаклей",
                "9 Пентаклей", "10 Пентаклей", "Туз Жезлов", "2 Жезлов", "3 Жезлов", "4 Жезлов", "5 Жезлов",
                "6 Жезлов", "7 Жезлов", "8 Жезлов", "9 Жезлов", "10 Жезлов", "Туз Кубков", "2 Кубков", "3 Кубков",
                "4 Кубков", "5 Кубков", "6 Кубков", "7 Кубков", "8 Кубков", "9 Кубков", "10 Кубков", "Туз Мечей",
                "2 Мечей", "3 Мечей", "4 Мечей", "5 Мечей", "6 Мечей", "7 Мечей", "8 Мечей", "9 Мечей", "10 Мечей",
                "Паж Пентаклей", "Паж Жезлов", "Паж Кубков", "Паж Мечей", "Рыцарь Пентаклей", "Рыцарь Жезлов",
                "Рыцарь Кубков", "Рыцарь Мечей", "Королева Пентаклей", "Королева Жезлов", "Королева Кубков",
                "Королева Мечей", "Король Пентаклей", "Король Жезлов", "Король Кубков", "Король Мечей"};

    }

    public String[] getAllAnswer() {

        return new String[]{"· Начни что-то новое без лишних раздумий. Удача на стороне смелых!",
                "· Ты обладаешь всеми ресурсами. Время действовать уверенно.",
                "· Доверяй интуиции. Молчание сегодня красноречивее слов.",
                "· Творчество и забота принесут удовлетворение.",
                "· Прояви организаторские способности. Структурируй хаос.",
                "· Получишь мудрый совет. Пришло время учиться.",
                "· Важный выбор. Сердце и разум должны прийти к согласию.",
                "· Двигайся к цели решительно. Победа в твоих руках!",
                "· Терпение и мягкость победят любые препятствия.",
                "· Полезно побыть одному. Ответы придут изнутри.",
                "· Время крутого поворота! Доверяй потоку событий.",
                "· Принимай взвешенные решения. Карма работает быстро.",
                "· Взгляни на ситуацию под новым углом. Пауза - это благо.",
                "· Освободись от старого. Преображение неизбежно.", "· Ищи баланс во всем. Гармония - твой козырь.",
                "· Осторожнее с искушениями! Осознай свои ограничения.",
                "· Неожиданные перемены к лучшему. Старое рушится для нового.",
                "· Мечтай смелее! Впереди период надежды и вдохновения.",
                "· Прислушивайся к подсознанию. Не все так очевидно, как кажется.",
                "· Идеальный день для радости и самовыражения! Сияй!",
                "· Время переоценки. Пришло время понять прошлые уроки.",
                "· Цикл завершен. Наслаждайся гармонией и готовься к новому.",
                "· Блестящая финансовая возможность! Хватай удачу за хвост!",
                "· Жонглируй ресурсами мудро. Баланс - твой лучший друг сегодня.",
                "· Успех в командной работе. Совместный труд принесет плоды.",
                "· Сохраняй стабильность. Надежность важнее авантюр.",
                "· Временные трудности. Ищи поддержку - ты не одинок.",
                "· Щедрость вернется бумерангом. Поделись ресурсами",
                "· Упорный труд скоро даст результат. Не сбавляй темп!",
                "· Вложи силы в перспективное дело. Это окупится сторицей.",
                "· Наслаждайся плодами труда. Ты это заслужил(а)!",
                "· Процветание и стабильность в семье. Финансовая надежность.",
                "· Новый проект или вдохновение! Действуй смело!",
                "· Планируй смелые цели. Мир ждет твоих свершений.",
                "· Первые результаты! Продолжай в том же духе!",
                "· Наслаждайся стабильностью и готовься к новому рывку.",
                "· Конкуренция обостряется. Отстаивай свою позицию.",
                "· Признание заслуг! Твои победы видят окружающие.",
                "· Отстаивай свои интересы. Прояви стратегическое мышление.",
                "· Быстрое движение к цели. Энергия бьет ключом!",
                "· Будь настороже. Защищай достигнутое.",
                "· Взял(а) на себя слишком много? Перераспредели нагрузку.",
                "· Новая любовь или глубокая эмоциональная связь!",
                "· Гармония в отношениях. Взаимность и радость общения.",
                "· Веселье в компании друзей. Праздник души!",
                "· Время переоценить ценности. Небольшая эмоциональная пауза.",
                "· Разочарование пройдет. Цени то, что осталось.",
                "· Ностальгия или приятная неожиданность из прошлого.",
                "· Выбор между чувством и разумом. Слушай сердце!", "· Время отпускать старое. Новые горизонты ждут.",
                "· Исполнение заветного желания. Полное удовлетворение!",
                "· Семейное счастье и душевная гармония. Идеальный союз.",
                "· Ясность мысли! Прорыв в понимании ситуации.",
                "· Внутренние противоречия. Время взвесить все \"за\" и \"против\".",
                "· Душевная боль учит мудрости. Прими этот урок.",
                "· Время восстановить силы. Отдохни и перегруппируйся.",
                "· Конфликт не принесет победы. Ищи компромисс.",
                "· Выход из трудной ситуации. Двигайся вперед!",
                "· Нечестные методы вокруг. Сохраняй бдительность.",
                "· Чувство ограничения иллюзорно. Ты можешь больше!",
                "· Тревожные мысли. Позволь себе отпустить контроль.",
                "· Тяжелый цикл завершен. Впереди - облегчение.",
                "· Хорошие финансовые новости.",
                "· Энтузиазм и новые идеи в сфере финансов.", "· Приятный сюрприз или предложение в сфере финансов.",
                "· Важное известие, будь внимателен в плане финансов.", "· Медленное, но верное продвижение",
                "· Решительные действия, скорость", "· Романтическое предложение",
                "· Резкие перемены, поспешные решения", "· Практичная и щедрая женщина",
                "· Энергичная и вдохновляющая личность", "· Чуткая и понимающая подруга",
                "· Остроумная и независимая женщина", "· Надежный партнер или начальник", "· Лидер, предприниматель",
                "· Мудрый и добрый советчик", "· Опытный стратег, судья"};
    }
    public String[] getMajorCards() {

        return new String[]{"0. ШУТ", "I. МАГ", "II. ВЕРХОВНАЯ ЖРИЦА", "III. ИМПЕРАТРИЦА", "IV. ИМПЕРАТОР",
                "V. ИЕРОФАНТ", "VI. ВЛЮБЛЁННЫЕ", "VII. КОЛЕСНИЦА", "VIII. СИЛА", "IX. ОТШЕЛЬНИК", "X. КОЛЕСО ФОРТУНЫ",
                "XI. ПРАВОСУДИЕ", "XII. ПОВЕШЕННЫЙ", "XIII. СМЕРТЬ", "XIV. УМЕРЕННОСТЬ", "XV. ДЬЯВОЛ", " XVI. БАШНЯ",
                "XVII. ЗВЕЗДА", "XVIII. ЛУНА", "XIX. СОЛНЦЕ", "XX. СУД", "XXI. МИР"};
    }

    public String[] getFirstMajorAnswer() {

        return new String[]{"· Энергия дня: Начало, спонтанность, доверие пути.",
                "· Энергия дня: Концентрация, воля, реализация.", "· Энергия дня: Интуиция, тайна, пауза.",
                "· Энергия дня: Изобилие, забота, творчество.", "· Энергия дня: Структура, контроль, порядок.",
                "· Энергия дня: Традиции, знания, мораль.", "· Энергия дня: Выбор, гармония, искушение.",
                "· Энергия дня: Движение, воля, победа.", "· Энергия дня: Смирение, храбрость, мягкая сила.",
                "· Энергия дня: Самоанализ, уединение, поиск истины.",
                "· Энергия дня: Судьба, неожиданный поворот, удача.", "· Энергия дня: Баланс, карма, справедливость.",
                "· Энергия дня: Ожидание, сдача, новая перспектива.",
                "· Энергия дня: Трансформация, конец, освобождение.", "· Энергия дня: Гармония, исцеление, терпение.",
                "· Энергия дня: Соблазн, зависимость, искушение.",
                "· Энергия дня: Внезапные изменения, крах иллюзий, откровение.",
                "· Энергия дня: Надежда, исцеление, вдохновение.", "· Энергия дня: Иллюзии, страх, подсознание.",
                "· Энергия дня: Успех, радость, ясность.", "· Энергия дня: Пробуждение, призыв, переоценка.",
                "· Энергия дня: Завершение, интеграция, гармония."};
    }

    public String[] getSecondMajorAnswer(){

        return new String[]{"· Что делать: Позволь себе небольшую авантюру. Действуй не по плану. Будь открыт неожиданностям — они принесут удачу.",
                "· Что делать: У тебя есть все ресурсы. Чётко сформулируй цель и действуй. Сегодня ты можешь проявлять чудеса эффективности.",
                "· Что делать: Доверяй внутреннему голосу, а не логике. Внимай знакам и снам. Лучшее решение сегодня — подождать и прислушаться.",
                "· Что делать: Создавай красоту вокруг. Позаботься о доме, растениях, своём теле. Идеальный день для хобби и проявления нежности.",
                "· Что делать: Составь чёткий план и следуй ему. Бери ответственность. Наведи порядок в делах и мыслях. Действуй по правилам.",
                "· Что делать: Ищи совет у мудрых людей или в проверенных источниках. Учись. Поступай \"как положено\". Возможен важный разговор по душам.",
                "· Что делать: Тебя ждёт важный выбор (пусть и небольшой). Прислушайся не только к разуму, но и к сердцу. Стремись к согласию с собой и другими.",
                "· Что делать: Активно продвигай свои проекты. Бери контроль в свои руки. Сегодня ты можешь добиться быстрого прогресса через решительность.",
                "· Что делать: Управляй эмоциями через терпение, а не агрессию. Прояви великодушие. Твоя сила сегодня — в мягкости и уверенности.",
                "· Что делать: Проведи время наедине с собой. Задавай важные вопросы. Ищи ответы внутри. Отдохни от суеты.",
                "· Что делать: Будь готов к неожиданностям — как приятным, так и не очень. Цикл завершается. Доверяй ходу событий.",
                "· Что делать: Взвешивай все \"за\" и \"против\". Будь честен с собой и другими. Возможно, подведение итогов или важное решение.",
                "· Что делать: Не дави. Прими паузу. Посмотри на ситуацию с другого ракурса. Иногда бездействие — лучшая стратегия.",
                "· Что делать: Отпусти то, что отжило. Завершай циклы. Сегодня идеальный день, чтобы избавиться от старого хлама — как физического, так и ментального.",
                "· Что делать: Ищи золотую середину. Смешивай, приспосабливайся, находи компромиссы. Действуй без спешки.",
                "· Что делать: Будь честен: что держит тебя в плену? Осознай свои \"оковы\". Сегодня легко поддаться искушению — прояви осознанность.",
                "· Что делать: Будь гибок. То, что рушится, — не твоя опора. Прими перемены — они расчистят место для нового.",
                "· Что делать: Делись своим светом. Мечтай и строй планы. Верь в лучшее. Идеальный день для творчества и восстановления сил.",
                "· Что делать: Доверяй интуиции, но проверяй факты. Не всё, что ты видишь, — правда. Возможны мелкие обманы или самообман.",
                "· Что делать: День сияния! Делись optimism. Берись за самые смелые идеи. Всё будет получаться. Наслаждайся жизнью.",
                "· Что делать: Пришло время для итогов и осознания уроков. Услышь свой \"зов\". Возможно, важное известие, которое всё изменит.",
                "· Что делать: Цикл успешно завершён. Наслаждайся заслуженным покоем и чувством целостности. Готовься к новому этапу."};
    }
}
